In [1]:
import numpy as np
import pandas as pd

#### Hierarchical Indexing
Hierarchical indexing is an important feature of pandas that enables you to have mul‚Äê tiple (two or more) index levels on an axis.

In [2]:
data = pd.Series(
    np.random.randn(9),
    index=[
    ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
    [1, 2, 3, 1, 3, 1, 2, 2, 3]
    ]
)
data

a  1   -1.157033
   2   -0.986409
   3    0.795396
b  1    1.587830
   3   -0.097979
c  1    0.431149
   2    0.121772
d  2    0.932574
   3    0.224914
dtype: float64

In [3]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [4]:
data['b']

1    1.587830
3   -0.097979
dtype: float64

In [5]:
data['b':'c']

b  1    1.587830
   3   -0.097979
c  1    0.431149
   2    0.121772
dtype: float64

In [6]:
data.loc[['b', 'd']]

b  1    1.587830
   3   -0.097979
d  2    0.932574
   3    0.224914
dtype: float64

In [7]:
data.loc[:, 2]

a   -0.986409
c    0.121772
d    0.932574
dtype: float64

In [8]:
data.unstack()

          1         2         3
a -1.157033 -0.986409  0.795396
b  1.587830       NaN -0.097979
c  0.431149  0.121772       NaN
d       NaN  0.932574  0.224914

In [9]:
data.unstack().stack()

a  1   -1.157033
   2   -0.986409
   3    0.795396
b  1    1.587830
   3   -0.097979
c  1    0.431149
   2    0.121772
d  2    0.932574
   3    0.224914
dtype: float64

In [10]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [11]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [12]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

#### Indexing with a DataFrame‚Äôs columns
It‚Äôs not unusual to want to use one or more columns from a DataFrame as the row index; alternatively, you may wish to move the row index into the DataFrame‚Äôs col‚Äê umns.

In [13]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [14]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [15]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

#### Summary Statistics by Level

In [16]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [17]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### Indexing with a DataFrame‚Äôs columns

In [18]:
frame = pd.DataFrame({
    'a': range(7),
    'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd':[0,1,2,0,1,2,3]
})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [19]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [20]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

#### Combining and Merging Datasets

In [21]:
df1 = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})

df2 = pd.DataFrame({
    'key': ['a', 'b', 'd'],
    'data2': range(3)})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [22]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

#### DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
Merge DataFrame objects by performing a database-style join operation by columns or indexes.

If joining columns on columns, the DataFrame indexes will be ignored. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.

In [23]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [24]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [25]:
df3 = pd.DataFrame({
    'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})

df4 = pd.DataFrame({
    'rkey': ['a', 'b', 'd'],
    'data2': range(3)})

pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

#### how : {‚Äòleft‚Äô, ‚Äòright‚Äô, ‚Äòouter‚Äô, ‚Äòinner‚Äô}, default ‚Äòinner‚Äô

left: use only keys from left frame, similar to a SQL left outer join; preserve key order

right: use only keys from right frame, similar to a SQL right outer join; preserve key order

outer: use union of keys from both frames, similar to a SQL full outer join; sort keys lexicographically

inner: use intersection of keys from both frames, similar to a SQL inner join; preserve the order of the left keys

In [26]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

#### Merging on Index

In [27]:
left1 = pd.DataFrame({
    'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})

right1 = pd.DataFrame({
    'group_val': [3.5, 7]}, 
    index=['a', 'b'])


left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [28]:
right1

   group_val
a        3.5
b        7.0

In [29]:
# the default merge method is to intersect the join keys
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [30]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [31]:
left1.merge(right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

#### DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
Join columns with other DataFrame either on index or on a key column. Efficiently Join multiple DataFrame objects by index at once by passing a list.

DataFrame‚Äôs join method performs a left join on the join keys, exactly preserving the left frame‚Äôs row index.

In [32]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

#### Concatenating Along an Axis

In [33]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [34]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

#### pandas.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=None, copy=True)
Concatenate pandas objects along a particular axis with optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis, which may be useful if the labels are the same (or overlapping) on the passed axis number.

In [35]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [36]:
pd.concat([s2, s1, s3], axis=1, sort=True)

     0    1    2
a  NaN  0.0  NaN
b  NaN  1.0  NaN
c  2.0  NaN  NaN
d  3.0  NaN  NaN
e  4.0  NaN  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [37]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [38]:
pd.concat([s1, s4], axis=1, sort=True, join='inner')

   0  1
a  0  0
b  1  1

#### When row index does "not" contain any relevant data

In [39]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

df1

          a         b         c         d
0  0.511899 -0.722556 -0.841687 -0.768542
1  0.748265 -2.207559 -0.565367 -1.082345
2 -0.254192 -1.753535  0.950563 -0.002281

In [40]:
df2

          b         d         a
0  0.299513  0.831781 -0.099864
1 -0.107483 -2.024328  1.082318

In [41]:
pd.concat([df1, df2], ignore_index=True, sort=True)

          a         b         c         d
0  0.511899 -0.722556 -0.841687 -0.768542
1  0.748265 -2.207559 -0.565367 -1.082345
2 -0.254192 -1.753535  0.950563 -0.002281
3 -0.099864  0.299513       NaN  0.831781
4  1.082318 -0.107483       NaN -2.024328